---
kind: property
id: P:Autodesk.Revit.DB.Material.Shininess
zh: 材质、材料
source: html/fd68b125-5b55-4abc-79e2-55691d45a7ad.htm
---
# Autodesk.Revit.DB.Material.Shininess Property

**中文**: 材质、材料

The shininess of the material.

## Syntax (C#)
```csharp
public int Shininess { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: values for shininess must be between 0 and 128